In [1]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [2]:
import pandas as pd

In [5]:
amazon_df = pd.read_csv('/content/drive/MyDrive/ca.webinars/Pandas Series/data/amzn.csv', index_col=0)
tesla_df = pd.read_csv('/content/drive/MyDrive/ca.webinars/Pandas Series/data/tsla.csv', index_col=0)

In [6]:
amazon_df.head()

         Date        Close   Volume Symbol
0  2020-07-01  2878.699951  6363400   AMZN
1  2020-07-02  2890.300049  6593400   AMZN
2  2020-07-06  3057.040039  6880600   AMZN
3  2020-07-07  3000.120117  5257500   AMZN
4  2020-07-08  3081.110107  5037600   AMZN

In [7]:
tesla_df.head()

         Date       Close       Volume Symbol
0  2020-07-01  223.925995   66634500.0   TSLA
1  2020-07-02  241.731995   86250500.0   TSLA
2  2020-07-06  274.316010  102849500.0   TSLA
3  2020-07-07  277.971985  107448500.0   TSLA
4  2020-07-08  273.175995   81556500.0   TSLA

In [8]:
amazon_df.shape == tesla_df.shape

True

In [9]:
amazon_df.shape

(147, 4)

In [10]:
# 1. Concatenate two (or more) dataframes

In [11]:
concat_df = pd.concat([amazon_df, tesla_df], axis=0)

In [12]:
concat_df.shape

(294, 4)

In [13]:
concat_df.tail()

           Date       Close      Volume Symbol
142  2021-01-25  880.799988  41173400.0   TSLA
143  2021-01-26  883.090027  23131600.0   TSLA
144  2021-01-27  864.159973  27334000.0   TSLA
145  2021-01-28  835.429993  26378000.0   TSLA
146  2021-01-29  793.530029  34990800.0   TSLA

In [14]:
concat_df.reset_index(drop=True, inplace=True)

In [20]:
final_df = concat_df.sort_values(by=['Date', 'Symbol']).reset_index(drop=True)

In [21]:
final_df.head()

         Date        Close      Volume Symbol
0  2020-07-01  2878.699951   6363400.0   AMZN
1  2020-07-01   223.925995  66634500.0   TSLA
2  2020-07-02  2890.300049   6593400.0   AMZN
3  2020-07-02   241.731995  86250500.0   TSLA
4  2020-07-06  3057.040039   6880600.0   AMZN

In [23]:
new_df = amazon_df.append(tesla_df)
final_df01 = new_df.sort_values(by=['Date', 'Symbol']).reset_index(drop=True)

In [24]:
final_df01.head()

         Date        Close      Volume Symbol
0  2020-07-01  2878.699951   6363400.0   AMZN
1  2020-07-01   223.925995  66634500.0   TSLA
2  2020-07-02  2890.300049   6593400.0   AMZN
3  2020-07-02   241.731995  86250500.0   TSLA
4  2020-07-06  3057.040039   6880600.0   AMZN

In [25]:
# 2. Merging two dataframes

In [26]:
pd.concat([amazon_df, tesla_df], axis=1).head()

         Date        Close   Volume  ...       Close       Volume  Symbol
0  2020-07-01  2878.699951  6363400  ...  223.925995   66634500.0    TSLA
1  2020-07-02  2890.300049  6593400  ...  241.731995   86250500.0    TSLA
2  2020-07-06  3057.040039  6880600  ...  274.316010  102849500.0    TSLA
3  2020-07-07  3000.120117  5257500  ...  277.971985  107448500.0    TSLA
4  2020-07-08  3081.110107  5037600  ...  273.175995   81556500.0    TSLA

[5 rows x 8 columns]

In [27]:
def tidying_df(df: pd.DataFrame):
  symbol = df['Symbol'].drop_duplicates().values[0]
  df.drop(['Symbol', 'Volume'], axis=1, inplace=True)
  df.set_index('Date', inplace=True)
  df.columns = [symbol]
  return df

In [28]:
amazon_df_agg = tidying_df(amazon_df)
tesla_df_agg = tidying_df(tesla_df)

In [29]:
amazon_df_agg.head()

                   AMZN
Date
2020-07-01  2878.699951
2020-07-02  2890.300049
2020-07-06  3057.040039
2020-07-07  3000.120117
2020-07-08  3081.110107

In [30]:
tesla_df_agg.head()

                  TSLA
Date
2020-07-01  223.925995
2020-07-02  241.731995
2020-07-06  274.316010
2020-07-07  277.971985
2020-07-08  273.175995

In [32]:
merged_df = amazon_df_agg.merge(tesla_df_agg, on='Date', how='inner')

In [33]:
pd.concat([amazon_df_agg, tesla_df_agg], axis=1).head()

                   AMZN        TSLA
Date
2020-07-01  2878.699951  223.925995
2020-07-02  2890.300049  241.731995
2020-07-06  3057.040039  274.316010
2020-07-07  3000.120117  277.971985
2020-07-08  3081.110107  273.175995

In [34]:
# 3. Explode

In [39]:
df = pd.DataFrame(
    {
        "User": ['Andy', 'Richard', 'Jeremy'],
        "Ratings": [[5,4,5],[4,5,4],[4,3,5]],
        "System": [['android', 'ios', 'ios'], ['android', 'android', 'android'], ['ios', 'ios', 'android']],
    }

)

In [40]:
df

      User    Ratings                       System
0     Andy  [5, 4, 5]          [android, ios, ios]
1  Richard  [4, 5, 4]  [android, android, android]
2   Jeremy  [4, 3, 5]          [ios, ios, android]

In [38]:
df.explode('Ratings').reset_index(drop=True)

      User Ratings
0     Andy       5
1     Andy       4
2     Andy       5
3  Richard       4
4  Richard       5
5  Richard       4
6   Jeremy       4
7   Jeremy       3
8   Jeremy       5

In [41]:
df.set_index('User').apply(pd.Series.explode).reset_index()

      User Ratings   System
0     Andy       5  android
1     Andy       4      ios
2     Andy       5      ios
3  Richard       4  android
4  Richard       5  android
5  Richard       4  android
6   Jeremy       4      ios
7   Jeremy       3      ios
8   Jeremy       5  android